In [1]:
import pandas as pd

score_df = pd.DataFrame([[1,50,80,70,'boy',1], 
              [2,60,45,50,'boy',2],
              [3,98,43,55,'boy',1],
              [4,70,69,89,'boy',2],
              [5,56,79,60,'girl',1],
              [6,60,68,55,'girl',2],
              [7,45,70,77,'girl',1],
              [8,55,77,76,'girl',2],
              [9,25,57,60,'girl',1],
              [10,88,40,43,'girl',3],
              [11,25,60,45,'boy',3],
              [12,80,60,23,'boy',3],
              [13,20,90,66,'girl',3],
              [14,50,50,50,'girl',3],
              [15,89,67,77,'girl',3]],columns=['student_id','math_score','english_score','chinese_score','sex','class'])
score_df

    student_id  math_score  english_score  chinese_score   sex  class
0            1          50             80             70   boy      1
1            2          60             45             50   boy      2
2            3          98             43             55   boy      1
3            4          70             69             89   boy      2
4            5          56             79             60  girl      1
5            6          60             68             55  girl      2
6            7          45             70             77  girl      1
7            8          55             77             76  girl      2
8            9          25             57             60  girl      1
9           10          88             40             43  girl      3
10          11          25             60             45   boy      3
11          12          80             60             23   boy      3
12          13          20             90             66  girl      3
13          14          50             50             50  girl      3
14          15          89             67             77  girl      3

In [11]:
#1.找出全年級各科成績最高分與最低分?

score_df.groupby(['sex', 'class']).agg(['max', 'min'])

           student_id     math_score     english_score     chinese_score
                  max min        max min           max min           max min
sex  class
boy  1              3   1         98  50            80  43            70  55
     2              4   2         70  60            69  45            89  50
     3             12  11         80  25            60  60            45  23
girl 1              9   5         56  25            79  57            77  60
     2              8   6         60  55            77  68            76  55
     3             15  10         89  20            90  40            77  43

In [13]:
#2.找出數學班平均最高的班級?

score_df.groupby('class').mean(['math_score'])

       student_id  math_score  english_score  chinese_score
class
1             5.0   54.800000      65.800000      64.400000
2             5.0   61.250000      64.750000      67.500000
3            12.5   58.666667      61.166667      50.666667

In [15]:
#3.分析全校女生與男生國文平均差幾分?

score_df.groupby('sex').mean(['chinese_score'])
62.666667-55.333333

7.333333999999994